$(document).ready(function () {
  $(".counter").counterUp({
    delay: 10,
    time: 1200,
  });
});


// $(document).ready(()=> {
//   let itemsToShow = 4; // Number of items to show initially
//   let itemsIncrement = 4; // Number of items to load on each "Load More" click
//   let $content = $('.articl'); // the content
//   let $items = $content.find('.test'); // the div which caotain information

//   // Hide items beyond the initial display limit
//   $items.slice(itemsToShow).hide();

//   // Load more items when the button is clicked
//   $('.loadMore').click(()=>{
//     let $hiddenItems = $items.filter(':hidden');
//     let itemsCount = $hiddenItems.length;

//     // Show the next set of items or all remaining hidden items
//     $hiddenItems.slice(0, itemsIncrement).slideDown();

//     // Hide the "Load More" button if there are no more hidden items
//     if (itemsCount <= itemsIncrement) {
//         $('.loadMore').hide();
//     }
// })
// });

$(document).ready(() => {
  var itemsToShow = 4; // Number of items to show initially
  $(".articl").slice(itemsToShow, articlArr.length).hide();
  $(".loadMore").click(() => {
    $(".articl:hidden").slice(0, itemsToShow).slideDown();
    if ($(".articl:hidden").length === 0) {
      $(".loadMore").hide();
    }
  });
});

// ============= service
let servArr = [
  {
    fa: `<i class="fa-solid fa-scale-balanced"></i>`,
    title: "الخدمة الأولى",
    desc: "نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجرتجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي ص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجرتجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي ",
  },
  {
    fa: `<i class="fa-solid fa-scale-balanced"></i>`,
    title: "الخدمة الثانية",
    desc: "نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجرتجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي ص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجرتجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي ",
  },
  {
    fa: `<i class="fa-solid fa-scale-balanced"></i>`,
    title: "الخدمة الثالثة",
    desc: "نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجرتجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي ص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجرتجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي ",
  },
];
servFunc();
function servFunc() {
  let cols = "";
  servArr.forEach((el) => {
    cols += `
    <div class="col-md-4">
    <div class="serv">
      <div class="servContent p-4">
        <div class="icon text-center rounded-circle mx-auto">
          ${el.fa}
        </div>
        <div class="servList text-center mt-4">
          <h3>${el.title} </h3>
          <p>${el.desc}</p>
        </div>
      </div>
    </div>
  </div>
    `;
  });
  /// the same as get element by id inner html
  $("#servCols").html(cols);
}

// ============= articls

let articlArr = [
  {
    img: "img/article.jpg",
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: "img/article.jpg",
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: "img/article.jpg",
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: "img/article.jpg",
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: "img/article.jpg",
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
  {
    img: `img/article.jpg`,
    title: `عنوان المقالة`,
    desc: `نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي  نص تجريبي نص تجريبي نص تجريبي نص تجريبي نص تجريبي......`,
    link: `https://www.parlmany.com/News/2/536743/%D9%84%D9%84%D9%85%D8%B3%D8%AA%D8%AB%D9%85%D8%B1%D9%8A%D9%86-%D8%AD%D9%83%D9%85-%D9%82%D8%B6%D8%A7%D8%A6%D9%89-%D8%A8%D8%A3%D8%AD%D9%82%D9%8A%D8%A9-%D8%A7%D9%84%D8%B4%D8%B1%D9%83%D8%A7%D8%AA-%D9%81%D9%8A-%D8%AE%D8%B5%D9%85-%D8%A7%D9%84%D8%B6%D8%B1%D8%A7%D8%A6%D8%A8-%D8%A7%D9%84%D9%85%D8%B3%D8%AF%D8%AF%D8%A9-%D8%B9%D9%84%D9%8A`,
  },
];

function articlFun() {
  let cols = ``;
  articlArr.forEach((el) => {
    cols += `
    <div class="col-lg-3 col-md-6 mb-3">
    <div class="articl">
    <div class="test">
      <img src="${el.img}" alt="articl image" class="img-fluid mb-4">
      <div class="linkToRead p-2">
        <h5 class="text-center"> ${el.title}</h5>
        <p>${el.desc}</p>
        <a href="${el.link}" target="_blank">إقرأ المزيد</a>
      </div>
      </div>
    </div>
</div>
    `;
  });
  $("#artCols").html(cols);
}

articlFun();
